{
    "textConverterTool": "https://onlinetexttools.com/json-stringify-text",
    "posts": [
        {
            "postId": "1",
            "title": "How to Get Your First Job in Customer Success",
            "author": "Melanie Moshi",
            "date": "Oct 8 2022",
            "readTime": "4",
            "links": {
                "medium": "https://medium.com/@melmoshi/how-to-get-your-first-job-in-customer-success-395ce395a738"
            },
            "description": "Looking to join the world of Customer Success? Applying to every CSM job you come across? Struggling to get your foot in the door without previous experience?\n\nYou’re not alone — but these steps can help get ahead of the rest.",
            "content": "Looking to join the world of Customer Success? Applying to every CSM job you come across? Struggling to get your foot in the door without previous experience? You/’re not alone — but these steps can help get ahead of the rest.\n            \n            Photo by Ian Schneider on Unsplash\n            Interviewing is a skill — become great at it!\n            You can have all the skills and experience in the world — but if you can’t convey your strengths during the interview (or connect with your future manager), you’ll never land a competitive role.\n            \n            One of the most important skills you can have to help you land your dream CSM job is simple: Become very good at interviews.\n            \n            Where to start? YouTube. There are tons of channels out there dedicated to interview prep, one of our favorites being Work It Daily. Start with “How to Answer: Tell Me About Yourself”, “How to Answer Any Behavioral Question”, and “8 Questions to Ask Your Hiring Manager”.\n            \n            Next? Real life practice (warning: may involve rejection — AKA learning!). Try to land as many interviews as you can — regardless of if you think it’s your “dream role” or not. This real life practice will fine-tune your answers, increase your confidence, and organically grow your network.\n            \n            Important Tip: As you practice and interview, keep a running document of every question you come across, and your ideal answer to that question. Keep this document on hand to review prior to every interview — you’ll become extremely comfortable reciting your answers over time.\n            \n            2. Understand the Lingo\n            \n            Even if you’ve never been in a Customer Success role before — you can still sound like a seasoned expert.\n            \n            How? Understanding the language that your future manager speaks in!\n            \n            Being able to pepper in terms like “Net Retention”, “Low Engagement”, “Adoption Growth”, “NPS Score”, or “Churn Mitigation” will go a long way in making you sound competent and strategic.\n            \n            It’s not enough simply to memorize these terms — you’ll need to actually understand them. Reading books, listening to podcasts, following influencers, and joining communities is your best bet to become proficient in Customer Success.\n            \n            Or, if you’re looking for a total game-changer — attend a (free) virtual Customer Success conference, like ReUp! It may change your life.\n            \n            3. Fine tune your reasoning of “Why” (and don’t say it’s because you like helping people)\n            \n            Why do you want to be a CSM?\n            \n            Think long and hard about this question before you convey your answer to your network.\n            \n            If your answer is “I like helping people” — you might be better off going into a Service/Support role. This desire and skillset are simply not enough to make you succeed as a CSM, and managers realize this.\n            \n            CSMs need to be driven and proactive when it comes to solving problems. It’s not good enough to just help someone — you need to be able to understand how you can help your client, and do it before they even ask.\n            \n            When someone asks you why you want to be a CSM — answer their question in a way that shows you understand the true priorities of the role (bonus points if you can subtly show-off your strategic and interpersonal skills).\n            \n            “I love building relationships and partnerships to create win-win scenarios. I feel fulfilled at the end of the day when I’ve provided value to my customers, which motivates me to better understand their problems and come up with strategic solutions to the issues they might be facing”.\n            \n            4. What can you bring to the table?\n            \n            One of the best things about Customer Success teams is that you can have 3 or 4 top-tier, high-performing CSMs that are absolutely crushing it within a company, and they can all have different strengths, personalities, and skill-sets!\n            \n            The truth is, when a manager is looking to add to their team via an external hire, they’re often looking to fill a “gap”, or find something unique that could elevate their team to the next level.\n            \n            So, what are unique strengths that you bring to a Customer Success team?\n            \n            For some, it’s all about building rock-solid relationships. For others, it’s finding value in data trends and KPIs. For the lucky few, it all comes down to jumping on a call with a c-suite executive and negotiating the team’s biggest upsell deal of the year.\n            \n            Realize what your biggest unique strengths are, and find a way to communicate them to your hiring manager.\n            \n            5. Develop the skills you lack\n            \n            Just like everyone has strengths, well… everyone has weaknesses too.\n            \n            Here are some common themes we see entry-level CSMs struggling with:\n            \n            Sales | Project Management | Public Speaking | Technical Skills | Setting Boundaries and Expectations | Negotiations | Influencing\n            \n            There are many free ways to develop any of these skills you may be lacking. Books, online articles, and YouTube videos are amazing places to start, and even a 5-minute video can go a long way (trust me).\n            \n            Bonus Tip: Grow Your Network!\n            \n            Add every CSM you meet on LinkedIn. Join as many online communities as you can. Go to in-person networking events found on meetup.com and talk about Customer Success to anyone who will listen.\n            \n            Not only does this help you practice for your interviews, but it organically increases your knowledge of the industry and creates invaluable connections to more experienced CSMs.\n            \n            PS: Many companies have very generous referral-bonus programs, and their employees may be happy to refer you after a conversation or two :) You might be surprised at how easy it can be.\n            \n            Get Networking! ☕️"
        },
        {
            "postId": "2",
            "title": "5 Reasons Why Customer Success is the Future (And Here to Stay)",
            "author": "Melanie Moshi",
            "date": "Oct 8 2022",
            "readTime": "4",
            "description": "Customer Success — it’s a hot term right now.\n\nIt’s one of the top growing jobs of 2020–2022, with more and more companies learning in on customer-centric philosophies.",
            "content": "Customer Success — it’s a hot term right now.\n\nIt’s one of the top growing jobs of 2020–2022, with more and more companies learning in on customer-centric philosophies.\n\nDoes that mean it’s a fad? The numbers (unquestionably) say no. Customer Success continues to remain an absolutely crucial part of every SaaS business, potentially even more-so during down-turns and recessions.\n\nHere’s a few reasons Customer Success is the future of SaaS:\n\nGetting new customers is expensive\nYes, even for lean software companies, gaining new customers can be an expensive process. In fact, many organizations have Customer Acquisition Costs (CAC) higher than their average annual contract value — meaning if a customer churns after one year, the company actually loses money.\n\nThe longer a customer stays with the company, the higher the Lifetime Value of a Customer. Companies can only be successful if their Customer Acquisition Cost is significantly less than the average Lifetime Value of a Customer.\n\nCustomer Acquisition Cost\nPhoto from ProductPlan (Customer Acquisition Cost)\nThe better your Customer Success team is, the bigger your LTV will be :)\n\n2. SaaS + Exponential Growth = ♥️\n\nThere’s a reason tech is so lucrative — sale repeatability and high profit margins leads to exponential growth. However, with great exponential growth comes great responsibility. The growing ARR needs to be protected in order to succeed, and it can be a lot of money at stake.\n\nFor example, at a scaling tech company, it may be normal for a Sales Team to set their target sales goal of 1MM ARR each quarter. Meanwhile, the Customer Success Team is responsible for renewing 5MM ARR each quarter — usually with less resources!\n\nIn summary: We all know it’s vital for a company to bring in new customers and new revenue sources. But the day is coming when Sales Teams and Customer Success Teams are viewed with equal importance.\n\n3. Customer Success teams are becoming highly efficient\n\nLeonard Bernstein once said “To achieve great things, two things are needed: a plan, and not quite enough time.”\n\nWhen Customer Success was in its infancy, Customer Success Managers (often Type-A planners) were struggling with lack of resources, lack of influence, and lack of time. Out of that pain, some incredible Customer Success software was born. PlanHat, Gainsight, ChurnZero, Totango, Catalyst, and CustomerSuccess are some examples of Customer Success software changing the game.\n\nWith insights, forecasting, strategic playbooks, and financial analysis at the fingertips of every CSM team — magic is happening ✨.\n\n4. Turning customers into sales leads\n\nAs we mentioned, acquiring new customers is expensive.\n\nBut what if we could do it for free?\n\nOrganic referrals (especially from influential leaders in the space) don’t just happen overnight. But when they do — 👌 — Instant success. Customer Success Managers use their superpowers to turn content, disengaged users into advocates, champions, cheerleaders, and evangelists of the product.\n\nThis leads to referrals, which leads to sales, which leads to more champions, which leads to more referrals…. You get the picture.\n\n5. Show me the money $$$\n\nMost Client Success teams do more than just retain clients. They grow them! A higher adoption of product modules will often lead to a higher likelihood of retention — and sometimes those modules come at an additional cost. Win-Win.\n\nTake a look at how one Client Success Manager might increase the Lifetime Value of a Customer through renewals, growth, and increased adoption:\n\n2016: The Sales Team signs a new customer at $50k/year\n\n2017: The CSM renews the contract at $50k/year\n\n2018: The CSM encourages new departments within the customer’s organization to start using the software. With additional seat licenses added into the contract, they renew at $70k/year\n\n2019: The CSM sells the customer a brand new module of the software, increasing efficiency and functionality. The client is happier than ever, and renews at $90k/year.\n\n2020: Still happy with the product and customer service, the customer renews at $90k/year and commits to in an additional 5 years on their contract (guaranteeing a LTV of at least $710k).\n\nLeadership and C-suite executives are starting to understand the financial impact Customer Success teams have on their bottom line (growth, profitability, and revenue), and are investing in their teams to succeed."
        }
    ]
}